// 구르미 갤러리 JS - main.js

////////////////////////////// 제이쿼리 로드구역 ////////////////////////////////
$(function(){ //////// jQB (제이쿼리 코드블록) //////////////////

    // 버튼 클릭시 이미지 이동하기 //
    // 대상 : .abtn -> .lb .rb 구분!
    $(".abtn").click(function(){
        console.log($(this).is(".rb"));
        /* 
            [ is() 메서드 ]
              : is는 그야말로 "상태를 알아내는" 메서드 
                is() 메서드는 선택요소의 태그나 이름을 확인함
                맞을경우 true 를 리턴함!
        */

        if($(this).is("rb")){ // 오른쪽 버튼일때

        } ///////////// if ////////////////
        else { // 왼쪽 버튼일때

        } ///////////// else //////////////
        
        
        
    }); ///////// click /////////////////////



}); /////////////////////// jQB //////////////////////////////////////////////
