// 제이쿼리 기본 JS - main.js

////////////////////////////// 제이쿼리 로드구역 ////////////////////////////////
$(function(){

    /// 타이틀 오버시 글자색, 배경색 변경
    //  대상 : .tit (여러번 쓸거면 변수에 할당)
    let tit = $(".tit");

    //  mouseover() 메서드 - 오버시 함수연결
    tit.mouseover(function(){

        // 변경대상 : .tit -> 나 자신 this 키워드
        $(this).css({
            color: "red",
            background: "yellow"
        });///// css /////

    });/////// mouseover 시 ///////////////

    // 마우스 아웃시 원상복귀
    // mouseout(함수) - 마우스 아웃시 함수연결
    tit.mouseout(function(){

        // 변경대상 : .tit -> 나 자신 this 키워드
        $(this).css({
            color: "yellow",
            background: "pink"
        });///// css /////

    });/////// mouseout 시 ///////////////


    ////////////////////////////////////////////////////
    // 1. 대상선정 변수할당 //////////////////////////////
    ////////////////////////////////////////////////////

    // 대상 1 : 버튼 - btns button
    let btns = $(".btns button");

    // 대상 2 : 미니언즈 - .mi
    let mi = $(".mi");

    // 대상 3 : 빌딩 - .building li
    let bd = $(".building li");

    // 대상 4 : 메시지 - .msg
    let msg = $(".msg");


    ////////////////////////////////////////////////////
    // 2. 초기화 셋팅 ///////////////////////////////////
    ////////////////////////////////////////////////////

    // 2-1. 모든 버튼 숨기고, 첫번째만 보이게 하기
    btns.hide().first().show() /* btns.hide(); // hide : 숨긴다. */
    // 버튼들을 .숨겨() . 첫번째()는 . 보여()
    // 주어는 하나! 뒤에 메서드 체인! (계속 붙여서 코딩할 수 있게 해준!)

    /* ()->함수 / hide() -> hide함수를 만든거임 */


    ////////////////////////////////////////////////////
    // 3. 버튼별 순서대로 클릭 이벤트 함수 만들기 /////////
    ////////////////////////////////////////////////////

    // 3-1. '들어가기' 버튼
    btns.first().click(function(){

        console.log("들어가기 버튼!");

        // 미니언즈 이동하기
        // 대상 : .mi -> mi 변수에 할당!
        mi.animate({
            top: "500px",
            left: "500px"
        }, 2000);

        /* 
            [ animate 메서드 ]
              animate({CSS설정},시간,이징,함수) 
            
              - CSS 설정에 따라, 애니메이션 연출 메서드
              - 시간 - 1/1000초 (단위없음)
              - 이징 - 가속도
              - 함수 - 애니후 실행코드 함수 (콜백함수)(뒤에서 호출한다해서 "콜백함수")
        */
        

    });////////////// 3-1 click //////////






















}); /////////////////////// jQB(제이쿼리 코드 블록) /////////////////////////////
///////////////////////////////////////////////////////////////////////////////